from runoob.com

***Java 基础语法***<br/>
***Java 对象和类***<br/>
***Java 基本数据类型***<br/>
***Java 变量类型***<br/>
***Java 修饰符***<br/>

***

## Java 基础语法
* 一个Java程序可以认为是一系列对象的集合

1. 对象：对象是类的一个实例，有状态和行为
2. 类：类是一个模板，它描述一类对象的行为和状态。
3. 方法：方法就是行为，一个类可以有很多方法。逻辑运算、数据修改以及所有动作都是在方法中完成的。
4. 实例变量：每个对象都有独特的实例变量，对象的状态由这些实例变量的值决定

* Exp

	```
	C : > javac HelloWorld.java
	C : > java HelloWorld
	Hello World
	```

#### 基本语法
1. 大小写敏感
2. 类名：对于所有的类来说，类名的首字母应该大写
3. 方法名：所有的方法名都应该以小写字母开头
4. 源文件名：源文件名必须和类名相同。
5. 主方法入口：所有的Java 程序由public static void main(String []args)方法开始执行。

#### Java标识符
* 类名、变量名以及方法名都被称为标识符

1. 有的标识符都应该以字母（A-Z或者a-z）,美元符（$）、或者下划线（_）开始
2. 首字符之后可以是字母（A-Z或者a-z）,美元符（$）、下划线（_）或数字的任何字符组合
3. 关键字不能用作标识符
4. 标识符是大小写敏感的
5. 合法标识符举例：age、$salary、_value、__1_value
6. 非法标识符举例：123abc、-salary

#### Java修饰符
1. 访问控制修饰符 : default, public, protected, private
2. 非访问控制修饰符 : final, abstract, static

#### Java变量
1. 局部变量
2. 类变量（静态变量）
3. 成员变量（非静态变量）

#### Java数组
* 数组是储存在堆上的对象，可以保存多个同类型变量

#### Java枚举
* Java 5.0引入了枚举，枚举限制变量只能是预先设定好的值

> 例如，我们为果汁店设计一个程序，它将限制果汁为小杯、中杯、大杯。这就意味着它不允许顾客点除了这三种尺寸外的果汁

```Java
class FreshJuice {
   enum FreshJuiceSize{ SMALL, MEDIUM, LARGE }
   FreshJuiceSize size;
}

public class FreshJuiceTest {
   public static void main(String []args){
      FreshJuice juice = new FreshJuice();
      juice.size = FreshJuice.FreshJuiceSize.MEDIUM;
   }
}
// 没看懂……
```

#### Java关键字
1. abstract	抽象方法，抽象类的修饰符
2. assert	断言条件是否满足
3.boolean	布尔数据类型
4. break	跳出循环或者label代码段
5. byte	8-bit 有符号数据类型
6. case	switch语句的一个条件
7. catch	和try搭配扑捉异常信息
8. char	16-bit Unicode字符数据类型
9. class	定义类
10. const	未使用
11. continue	不执行循环体剩余部分
12. default	switch语句中的默认分支
13. do	循环语句，循环体至少会执行一次
14. double	64-bit双精度浮点数
15. else	if条件不成立时执行的分支
16. enum	枚举类型
17. extends	表示一个类是另一个类的子类
18. final	表示一个值在初始化之后就不能再改变了,表示方法不能被重写，或者一个类不能有子类
19. finally	为了完成执行的代码而设计的，主要是为了程序的健壮性和完整性，无论有没有异常发生都执行代码。
20. float	32-bit单精度浮点数
21. for	for循环语句
22. goto	未使用
23. if	条件语句
24. implements	表示一个类实现了接口
25. import	导入类
26. instanceof	测试一个对象是否是某个类的实例
27. int	32位整型数
28. interface	接口，一种抽象的类型，仅有方法和常量的定义
29. long	64位整型数
30. native	表示方法用非java代码实现
31. new	分配新的类实例
32. package	一系列相关类组成一个包
33. private	表示私有字段，或者方法等，只能从类内部访问
34. protected	表示字段只能通过类或者其子类访问,子类或者在同一个包内的其他类
35. public	表示共有属性或者方法
36. return	方法返回值
37. short	16位数字
38. static	表示在类级别定义，所有实例共享的
39. strictfp	浮点数比较使用严格的规则
40. super	表示基类
41. switch	选择语句
42. synchronized	表示同一时间只能由一个线程访问的代码块
43. this	表示调用当前实例,或者调用另一个构造函数
44. throw	抛出异常
45. throws	定义方法可能抛出的异常
46. transient	修饰不要序列化的字段
47. try	表示代码块要做异常处理或者和finally配合表示是否抛出异常都执行finally中的代码
48. void	标记方法不返回任何值
49. volatile	标记字段可能会被多个线程同时访问，而不做同步
50. while	while循环

#### 继承
* 在Java中，一个类可以由其他类派生。如果你要创建一个类，而且已经存在一个类具有你所需要的属性或方法，那么你可以将新创建的类继承该类。
* 利用继承的方法，可以重用已存在类的方法和属性，而不用重写这些代码。被继承的类称为超类（super class），派生类称为子类（subclass）。

#### 接口
* 在Java中，接口可理解为对象间相互通信的协议。接口在继承中扮演着很重要的角色。
* 接口只定义派生要用到的方法，但是方法的具体实现完全取决于派生类。

***

## Java 对象和类
1. 对象：对象是类的一个实例，有状态和行为
2. 类：类是一个模板，它描述一类对象的行为和状态。

* 一个类可以包含以下类型变量：
1. 局部变量：在方法、构造方法或者语句块中定义的变量被称为局部变量。变量声明和初始化都是在方法中，方法结束后，变量就会自动销毁。
2. 成员变量：成员变量是定义在类中，方法体之外的变量。这种变量在创建对象的时候实例化。成员变量可以被类中方法、构造方法和特定类的语句块访问。
3. 类变量：类变量也声明在类中，方法体之外，但必须声明为static类型。

#### 构造方法
* 每个类都有构造方法。如果没有显式地为类定义构造方法，Java编译器将会为该类提供一个默认构造方法。
* 在创建一个对象的时候，至少要调用一个构造方法。构造方法的名称必须与类同名，一个类可以有多个构造方法。
```Java
public class Puppy{
    public Puppy(){
    }

    public Puppy(String name){
        // 这个构造器仅有一个参数：name
    }
}
```

#### 创建对象
1. 声明：声明一个对象，包括对象名称和对象类型。
2. 实例化：使用关键字new来创建一个对象。
3. 初始化：使用new创建对象时，会调用构造方法初始化对象。

```Java
public class Puppy{
   public Puppy(String name){
      //这个构造器仅有一个参数：name
      System.out.println("小狗的名字是 : " + name );
   }
   public static void main(String []args){
      // 下面的语句将创建一个Puppy对象
      Puppy myPuppy = new Puppy( "tommy" );
   }
}
```

#### 源文件声明规则
1. 一个源文件中只能有一个public类
2. 一个源文件可以有多个非public类
3. 源文件的名称应该和public类的类名保持一致。例如：源文件中public类的类名是Employee，那么源文件应该命名为Employee.java。
4. 如果一个类定义在某个包中，那么package语句应该在源文件的首行。
5. 如果源文件包含import语句，那么应该放在package语句和类定义之间。如果没有package语句，那么import语句应该在源文件中最前面。
6. import语句和package语句对源文件中定义的所有类都有效。在同一源文件中，不能给不同的类不同的包声明。

#### Java包
* 包主要用来对类和接口进行分类。

***

## Java 基本数据类型*
* 两大数据类型:
1. 内置数据类型(八种基本类型。六种数字类型（四个整数型，两个浮点型），一种字符类型，还有一种布尔型。)

	> byte：

	>> 1. byte数据类型是8位、有符号的，以二进制补码表示的整数

	>> 2. 最小值是-128（-2^7）

	>> 3. 最大值是127（2^7-1）

	>> 4. 默认值是0

	>> 5. byte类型用在大型数组中节约空间，主要代替整数，因为byte变量占用的空> 间只有int类型的四分之一

	> short：

	>> 1. short数据类型是16位、有符号的以二进制补码表示的整数

	>> 2. 最小值是-32768（-2^15）

	>> 3. 最大值是32767（2^15 - 1）

	>> 4. Short数据类型也可以像byte那样节省空间。一个short变量是int型变量所占空间的二分之一

	>> 5. 默认值是0

	> int：

	>> 1. int数据类型是32位、有符号的以二进制补码表示的整数

	>> 2. 最小值是-2,147,483,648（-2^31）

	>> 3. 最大值是2,147,483,647（2^31 - 1）

	>> 4. 一般地整型变量默认为int类型

	>> 5. 默认值是0

	>long：

	>> 1. long数据类型是64位、有符号的以二进制补码表示的整数

	>> 2. 最小值是-9,223,372,036,854,775,808（-2^63）

	>> 3. 最大值是9,223,372,036,854,775,807（2^63 -1）

	>> 4. 这种类型主要使用在需要比较大整数的系统上

	>> 5. 默认值是0L

	> float：

	>> 1. float数据类型是单精度、32位、符合IEEE 754标准的浮点数

	>> 2. float在储存大型浮点数组的时候可节省内存空间

	>> 3. 默认值是0.0f

	>> 4. 浮点数不能用来表示精确的值，如货币

	> double：

	>> 1. double数据类型是双精度、64位、符合IEEE 754标准的浮点数

	>> 2. 浮点数的默认类型为double类型

	>> 3. double类型同样不能表示精确的值，如货币

	>> 4. 默认值是0.0d

	> boolean：

	>> 1. boolean数据类型表示一位的信息

	>> 2. 只有两个取值：true和false

	>> 3. 这种类型只作为一种标志来记录true/false情况

	>> 4. 默认值是false

	> char：

	>> 1. char类型是一个单一的16位Unicode字符

	>> 2. 最小值是’\u0000’（即为0）

	>> 3. 最大值是’\uffff’（即为65,535）

	>> 4. char数据类型可以储存任何字符

2. 引用数据类型

	*1. 引用类型指向一个对象，指向对象的变量是引用变量。变量一旦声明后，类型就不能被改变了。*

	*2. 对象、数组都是引用数据类型。*

	*3. 所有引用类型的默认值都是null。*

	*4. 一个引用变量可以用来引用与任何与之兼容的类型。*

#### Java常量
* 常量在程序运行时，不会被修改的量。使用 final 关键字来修饰常量，声明方式和变量类似：
```Java
final double PI = 3.1415927;
```
> 虽然常量名也可以用小写，但为了便于识别，通常使用大写字母表示常量。

#### 自动类型转换
* 整型、实型（常量）、字符型数据可以混合运算。运算中，不同类型的数据先转化为同一类型，然后进行运算。

> 转换从低级到高级。
>> byte,short,char > int > long > float > double

* 规则：
	1. 不能对boolean类型进行类型转换。
	2. 不能把对象类型转换成不相关类的对象。
	3. 在把容量大的类型转换为容量小的类型时必须使用强制类型转换。
	4. 转换过程中可能导致溢出或损失精度

* 浮点数到整数的转换是通过舍弃小数得到，而不是四舍五入，例如：

	>(int)23.7 == 23;

	>(int)-45.89f == -45

#### 强制类型转换
1. 条件是转换的数据类型必须是兼容的。
2. 格式：(type)value

> type是要强制类型转换后的数据类型

***

## Java 变量类型
1. 类变量：独立于方法之外的变量，用 static 修饰。
2. 实例变量：独立于方法之外的变量，不过没有 static 修饰。
3. 局部变量：类的方法中的变量。
